/*
    - 개발 순서
        0. 요구사항 작성(영업부)
        1. 요구사항 분석(기획부)
        2. 설계(개발부)
        3. 구현(개발부)
        4. 테스트(테스트팀)
        5. 유지보수(SM or 유지보수 팀)
        6. 배포(서버팀)

    - 사회경험 필요: 요구사항 작성 > 요구사항 분석 > 설계
    - 프로그래밍 문법: 구현 > 테스트 > 유지보수 
    - JS 메모리:
        변수: 하나의 데이터/자료 저장, 수정 가능
        상수: 하나의 데이터/자료 저장, 수정 불가능
    - JS 데이터/자료
        1. 문자
        2. 숫자
        3. 논리
        4. 배열
        5. undefined
        6. function
        - [] 배열
            : 여러개의 데이터/자료를 저장할 수 있는 하나의 데이터/자료
        - function 함수 
            : 여러개의 실행문/코드(;)들을 묶어서 하나의 데이터/자료
    
    - 변수와 데이터 관계
        [선언과 초기값 대입]

    - 실습을 통해 활용 
        실습 예) 게시판을 만드는데 제목, 내용, 비밀번호 
*/